# Find the original architecture at https://raw.githubusercontent.com/ultralytics/ultralytics/main/ultralytics/cfg/models/12/yolo12-cls.yaml
# YOLO12-cls-Refined for centric 
# CBAM attention added after deep feature extraction

# Parameters
nc: 4 
scales:
  n: [0.50, 0.25, 1024] 

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8-Feature Extraction Complete


# take o/p of layer 8 (1024 channels) and refine it
  - [-1, 1, CBAM, [1024]] # 9 - Refined Features

# YOLO12n head
head:
  - [-1, 1, Classify, [nc]] # 10 - Classify (Takes input from Layer 9 now)